//=======================================================================
//ゲームオーバー画面に関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _GAMEOVER_H_
#define _GAMEOVER_H_

//========================================================
//プロトタイプ宣言
//========================================================
void InitGameOver(void);
void UninitGameOver(void);
void UpdateGameOver(void);
void DrawGameOver(void);

#endif // !_GAMEOVER_H_