//=======================================================================
//プレイヤーのライフに関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _LIFE_H_
#define _LIFE_H_
#include "main.h"

//========================================================
//マクロ定義
//========================================================
#define MAX_LIFE_POLYGON (8)		//スコアのポリゴンの最大数
#define LIFE_HEIGHT (272.0f*0.15f)	//スコアのポリゴンの縦の大きさ
#define LIFE_WIDTH (350.0f*0.15f)	//スコアのポリゴンの横の大きさ

//========================================================
//構造体の定義
//========================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	bool bUse;			//使うかどうか

} Life;


//========================================================
//プロトタイプ宣言
//========================================================
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);
void SetLife(float nLife);
Life *GetLife(void);

#endif //!_LIFE_H_
