//=======================================================================
//必殺技のUIに関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _SPECIAL_H_
#define _SPECIAL_H_
#include "main.h"

//========================================================
//マクロ定義
//========================================================
#define SPECIAL_HEIGHT (321.0f*0.15f)	//SPのポリゴンの縦の大きさ
#define SPECIAL_WIDTH (302.0f*0.15f)	//SPのポリゴンの横の大きさ

//========================================================
//構造体の定義
//========================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	bool bUse;			//使うかどうか

} Special;


//========================================================
//プロトタイプ宣言
//========================================================
void InitSpecial(void);
void UninitSpecial(void);
void UpdateSpecial(void);
void DrawSpecial(void);
Special *GetSpecial(void);

#endif //!_SPECIAL_H_
