//=======================================================================
//ステージ1ゲーム背景に関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _STAGE1BG_H_
#define _STAGE1BG_H_

//========================================================
//プロトタイプ宣言
//========================================================
void InitStage1Bg(void);
void UninitStage1Bg(void);
void UpdateStage1Bg(void);
void DrawStage1Bg(void);

#endif // !_STAGE1BG_H_
