//=======================================================================
//ステージ3ゲーム背景に関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _STAGE3BG_H_
#define _STAGE3BG_H_

//========================================================
//プロトタイプ宣言
//========================================================
void InitStage3Bg(void);
void UninitStage3Bg(void);
void UpdateStage3Bg(void);
void DrawStage3Bg(void);

#endif // !_STAGE3BG_H_

