//=======================================================================
//操作説明画面に関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//========================================================
//プロトタイプ宣言
//========================================================
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif // !_TUTORIAL_H_

