//================================================
//弾処理
//Authore:加藤瑞葵
//================================================
#include "scene2D.h"
#include "scene.h"
#include "manager.h"
#include "bullet.h"
#include "renderer.h"
#include "explosion.h"
#include "sound.h"
#include "enemy.h"
#include "score.h"
#include "effect.h"

//================================================
//静的メンバ変数宣言
//================================================

//================================================
//デフォルトコンストラクタ
//================================================
CBullet::CBullet(int nPriority) :CScene2D(nPriority)
{
	m_size = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
}

//================================================
//オーバーロードされたコンストラクタ
//================================================


//================================================
//デストラクタ
//================================================
CBullet::~CBullet()
{

}

//================================================
//初期化処理
//================================================
HRESULT CBullet::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 move)
{
	m_size = size;
	m_move = move;

	CScene2D::Init(pos, size);

	return S_OK;
}

//================================================
//終了処理
//================================================
void CBullet::Uninit(void)
{
	CScene2D::Uninit();
}

//================================================
//更新処理
//================================================
void CBullet::Update(void)
{
	
}

//================================================
//描画処理
//================================================
void CBullet::Draw(void)
{
	CScene2D::Draw();
}