//=======================================================================
//フェードに関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _FADE_H_
#define _FADE_H_

//========================================================
//フェードの種類
//========================================================
typedef enum
{
	FADE_NONE = 0,		//何もしていない
	FADE_IN,			//フェードイン
	FADE_OUT,			//フェードアウト
	FADE_MAX
} FADE;


//========================================================
//プロトタイプ宣言
//========================================================
void InitFade(MODE modeNext);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(MODE modeNext);
FADE GetFade(void);

#endif // !_FADE_H_