//=======================================================================
//リザルトに関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _RESULT_H_
#define _RESULT_H_
#include "main.h"

//========================================================
//プロトタイプ宣言
//========================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif // !_RESULT_H_
