//=======================================================================
//ステージ1に関する処理
//Aouthor: 加藤　瑞葵
//=======================================================================

#ifndef _STAGE1_H_
#define _STAGE1_H_

//========================================================
//マクロ定義
//========================================================
#define MAX_LINE (18)		//ブロックの最大の行
#define MAX_COLUMN (614)		//ブロックの最大の列

//========================================================
//構造体
//========================================================
typedef struct
{
	bool bStop;		//ポーズしているかどうか
	int nSetEnemy;	//敵を沸かせる
} Stage1;

//========================================================
//プロトタイプ宣言
//========================================================
void InitStage1(void);
void UninitStage1(void);
void UpdateStage1(void);
void DrawStage1(void);
Stage1 *GetStage1(void);

#endif // !_STAGE1_H_