//=============================================================================
// タイトル1P画像コントロール処理 [control_title_1p.cpp]
// Author : KUSAKARI KAKERU
//=============================================================================
#include "control_title_1p.h"
#include "ui.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CControlTitle1P::CControlTitle1P()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CControlTitle1P::~CControlTitle1P()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlTitle1P::Init(void)
{
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlTitle1P::Uninit(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CControlTitle1P::Update(CScene *pScene)
{
	//引数のポインタをUiクラスのポインタにキャスト
	CUi *pUi = NULL;
	pUi = (CUi*)pScene;

	//オブジェクトの位置・サイズを取得
	D3DXVECTOR3 pos;
	pos = pUi->GetPos();
	D3DXVECTOR3 size;
	size = pUi->GetSize();

	// 画面下に来たら上昇させる
	if (pos.y >= SCREEN_HEIGHT + (size.y / 2))
	{
		m_move.y = 0;
		m_move.y -= TITLE_1P_RISE;
	}
	else
	{
		//常に下に下げる
		m_move.y += TITLE_1P_GRAVITY;
	}

	// 位置やサイズの設定
	pUi->SetPos(pos, size);
}

//=============================================================================
// 生成処理
//=============================================================================
CControlTitle1P *CControlTitle1P::Create()
{
	//インスタンスの生成
	CControlTitle1P *pControlTitle1P = NULL;

	if (pControlTitle1P == NULL)
	{
		pControlTitle1P = new CControlTitle1P;

		if (pControlTitle1P != NULL)
		{
			pControlTitle1P->Init();
		}
	}

	return pControlTitle1P;
}