//=============================================================================
// タイトル2P画像コントロール処理 [control_title_2p.cpp]
// Author : KUSAKARI KAKERU
//=============================================================================
#include "control_title_2p.h"
#include "ui.h"
//=============================================================================
// コンストラクタ
//=============================================================================
CControlTitle2P::CControlTitle2P()
{
	m_nStop = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CControlTitle2P::~CControlTitle2P()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CControlTitle2P::Init(void)
{
	m_nStop = TITLE_2P_STOP_TIME;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CControlTitle2P::Uninit(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CControlTitle2P::Update(CScene *pScene)
{
	m_nStop--;

	if (m_nStop <= 0)
	{
		//引数のポインタをUiクラスのポインタにキャスト
		CUi *pUi = NULL;
		pUi = (CUi*)pScene;

		//オブジェクトの位置・サイズを取得
		D3DXVECTOR3 pos;
		pos = pUi->GetPos();
		D3DXVECTOR3 size;
		size = pUi->GetSize();

		// 画面下に来たら上昇させる
		if (pos.y >= SCREEN_HEIGHT + size.y)
		{
			m_move.y = 0;
			m_move.y -= TITLE_2P_RISE;
		}
		else
		{
			//常に下に下げる
			m_move.y += TITLE_2P_GRAVITY;
		}

		// 位置やサイズの設定
		pUi->SetPos(pos, size);
	}
}

//=============================================================================
// 生成処理
//=============================================================================
CControlTitle2P *CControlTitle2P::Create()
{
	//インスタンスの生成
	CControlTitle2P *pControlTitle2P = NULL;

	if (pControlTitle2P == NULL)
	{
		pControlTitle2P = new CControlTitle2P;

		if (pControlTitle2P != NULL)
		{
			pControlTitle2P->Init();
		}
	}

	return pControlTitle2P;
}